[
  {
    "path": "posts/2021-05-15-dataviz-makeover-1/",
    "title": "DataViz Makeover 1 (Work in Progress)",
    "description": "In this post, we present a trade data use case applying the fundamentals of Visual Analytics using Tableau. We will critique the visualisation and propose an alternative to address the flaws.",
    "author": [
      {
        "name": "Kelly Koh",
        "url": "https://www.linkedin.com/in/kellykkw/"
      }
    ],
    "date": "2021-05-26",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Critique of Visualisation\r\n1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2. Proposed Design\r\n2.1 Clarity\r\n2.2 Aesthetic\r\n\r\n3. Proposed Visualisation on Tableau\r\n4. Step-By-Step Preparation\r\n5. Major Observations\r\n\r\n1. Critique of Visualisation\r\nThe original visualisation is created by using data provided by Department of Statistics, Singapore (DOS). The data are available under the sub-section of Merchandise Trade by Region/Market.\r\n\r\n1.1 Clarity\r\nTitles: The title and legend of the data visualization do not convey the message well.\r\nTitle mentions that the charts show merchandise trade of top six trading countries without clarifying that they are trading partners of Singapore. We are also unsure if the top six are selected based on total merchandise trade.\r\nOne of the charts feature Hong Kong, which is a special administration region of China, not a country.\r\nThe unit of measure is also not clear as neither the main title nor the legend title mention if the charts are measuring physical arrivals of merchandise or the monetary value of the merchandise. The source data reveals that the unit of measure is in Singapore dollars.\r\nTitle indicates that the data is from 2019 to 2020 but the charts show values from 2019 to 2021.\r\nTitle does not mention what is the granularity of the data presented (e.g. yearly, quarterly or monthly).\r\nNo insights highlighted\r\n\r\nChart Type: The area charts are standalone, making it hard for readers to compare the trade value across the partners.\r\nY-Axis: The Y-axes of the charts are misleading.\r\nThe scales of the dual axes of each chart are not synchronised. For example, maximum scale value of export to Hong Kong with tick mark is 6M and 800K for import. The horizontal tick lines follow the primary Y-axis (export). As such, we cannot visually tell what is the relative value of export and import.\r\nFurthermore, the scales of the Y-axes are not fixed across the six charts, preventing us from determining the relative ranking of the six countries/regions based on their merchandise trade.\r\n\r\nX-Axis: The X-axis of the charts are misleading.\r\nThe x-axis of the charts is labeled ‘Month of Period’ but only show the years without minor tick marks to indicate the months. We are unsure when does the data truly end.\r\n\r\nAnnotation / Source:\r\nThere is no annotation on the graph that highlights the significant finding or conclusion.\r\nThere is no recognition of the data source.\r\n\r\n1.2 Aesthetic\r\nLegend: The legend is placed on the right side of the chart. Readers could not immediately identify if the blue or yellow area refer to export or import.\r\nTitle: The main graphic title’s font size is smaller than the subtitle for each chart and not centralized.\r\nChart Order and Sizing: There is no obvious logic in the ordering of the six charts. The chart widths vary.\r\nAxis Labels: The axis labels for Y-axis and X-axis are repeated unnecessarily.\r\nColours and Shading: The area charts used blue and orange, which are friendly to color blind readers. And transparency is used to avoid occlusion issues. However, the overlap of blue and orange is distracting and prevent readers on focusing on the difference between export and import.\r\nData Ink: There is data ink on the axes labels but not the values of the tick marks.\r\n2. Proposed Design\r\nThe initial sketch of proposed design is as follow:\r\n\r\n2.1 Clarity\r\nTitles:\r\nTo use the term ‘trade partners’ to represent the countries and regions\r\nTo add a main visual title to give readers the context - ‘Singapore’s Merchandise Trade with Major Partners’\r\nTo have a title for each chart that showcases the main insight.\r\nTo add a functional subtitle for each chart. It should identify the granularity of the data, the unit of measure for the Y-Axis and the period covered.\r\nTo rename the legend title to ‘Trade Type’\r\n\r\nChart Type:\r\nOpt for trellis charts to allow easy comparison across the partners with 1 primary Y-axis\r\nAdd Chart 1, a bar chart to give readers an overview of how the 6 major trading partners are ranked based on annual total merchandise trade value and the changes in trade value year-on-year\r\nChart 2 will be a modified version of the original visualisation in trellis format\r\n\r\nY-Axis:\r\nKeep to a primary Y-axis\r\nIndicate the unit of measure ‘$X.XB’ on the scales and indicate the granularity in the label ‘(Billions)’\r\n\r\nX-Axis:\r\nFor Chart 2, indicate start of the year with ‘Month’ and ‘Year’ e.g. ‘Jan’19’ as major tick mark and every month as minor tick marks. Chart should not show 2021.\r\nFor Chart 2, add a reference line at start of 2020 to allow readers to easily compare between the monthly trends between 2019 and 2020\r\n\r\nAnnotation / Source:\r\nAdd annotations to Chart 2 to highlight points that supports the insights\r\nAdd data source at foot of visualisation\r\n\r\n2.2 Aesthetic\r\nLegend:\r\nAs the legend position is kept on the side, change the font color of the word ‘Export’ to blue and ‘Import’ to dark yellow to guide readers.\r\n\r\nTitle:\r\nAlign the titles to the left\r\nChoose distinctive font sizes for main visual title, chart title and chart subtitles\r\n\r\nChart Order and Sizing:\r\nRank the partners based on total trade value in the trellis charts\r\nAlign the tiles between Chart 1 and 2 so that readers can easily compare across charts if wanted\r\n\r\nData Ink:\r\nEnhance data ink for Y-axis and X-axis values and partner names\r\n\r\nAxis Labels:\r\nRemove both axis labels for ‘Country’ and ‘Month’ to avoid repetition and excess information\r\n\r\nColours and Shading:\r\nRemove the overlap between the blue and orange area\r\nOverlay the area charts with line charts to allow users to identify the trend easier\r\n\r\n3. Proposed Visualisation on Tableau\r\nPlease view the proposed visualisation on Tableau Public here.\r\n\r\n4. Step-By-Step Preparation\r\n\r\nNo\r\nStep\r\nAction\r\n1\r\nUnzip the output folder downloaded from the SingStat website. Load the outputFile excel file into Tableau Prep Builder. Drag the ‘T1’ and ‘T2’ worksheet into main pane.\r\n\r\n2\r\nUse the Data Interpreter. Rename ‘T1’ and ‘T2’ to ‘Import’ and ‘Export’ respectively and initiate the cleaning node from each data node.\r\n\r\n3\r\nUnder the ‘Clean 1’ node, clean ‘Variables’ using ‘Split Values’ with ‘(‘ as the separator. Rename column as ‘Country’. Repeat for ‘Clean 2’.\r\n\r\n4\r\nUnder ‘Clean 1’ node, filter the rows under ‘Country’ to remove non-Country and total observations. Repeat for ‘Clean 2’.\r\n\r\n5\r\nAdd Pivot nodes after ‘Clean 1’ and ‘Clean 2’. Under ‘Pivot 1’, select all months under ‘Fields’ to the ‘Pivoted Fields’ panel. Repeat for ‘Pivot 2’.\r\n\r\n6\r\nUnder ‘Pivot 1’, rename ‘Pivot1 Names’ to ‘Month’ and change data type to ‘Date’. Rename ‘Pivot1 Values’ to ‘Import (Thousand Dollars)’. Remove ‘Variables’. Repeat for ‘Pivot 2’ but rename ‘Pivot1 Values’ to ‘Export (Thousand Dollars)’.\r\n\r\n7\r\nDo a full join between ‘Pivot 1’ and ‘Pivot 2’ with ‘Country’ and ‘Month’ as the join clauses.\r\n\r\n8\r\nCreate a ‘Clean’ node after ‘Join 1’ to merge duplicated country and month variables.\r\n\r\n9\r\nCreate a ‘Pivot’ node after ‘Clean 3’ and change ‘Export (Thousand Dollars)’ and ‘Import (Thousand Dollars)’ from columns to rows.\r\n\r\n10\r\nSplit ‘Pivot1 Names’ and rename the field of ‘Split 1’ to ‘Trade Type’. Multiply ‘(Thousand Dollars)’ by 1000 and rename it ‘Trade Value’. Remove the unnecessary fields ‘(Thousand Dollars)’ and ‘Pivot1 Names’.\r\n\r\n11\r\nCreate a ‘Output’ node after ‘Pivot 3’ node and save output as ‘Monthly Singapore Merchandise Trade’.\r\n\r\n12\r\nSet up a connection on Tableau Desktop to the ‘Monthly Singapore Merchandise Trade’ hyper’s extract.\r\n\r\n13\r\nFor Chart 1, create a new worksheet and name it “Annual Trade’. Drag ‘Country’ and ‘Month’ to ‘Columns’ and ‘Trade Value’ to ‘Rows’ shelves.\r\n\r\n14\r\nDrag ‘Month’ to the ‘Filter Field’ section. Select ‘Range of Dates’ and indicate ‘1 Jan 2019’ as the start and ‘1 Dec 2020’ as the end.\r\n\r\n15\r\nDrag ‘Country’ to the ‘Filter Field’ section. Select the ‘Top’ tab and choose the top 6 by sum of ‘Trade Value’. Then exclude ‘Indonesia’ from the custom value list.\r\n\r\n16\r\nUnder ‘Marks’, select ‘Bar’ under the dropdown and drag ‘Trade Type’ to ‘Color’. Drag ‘Trade Value’ to ‘Label’ and add ‘Quick Table Calculation’ to add the ‘Percent of Total’ computed using ‘Cell’. Then drag ‘Trade Value’ to label again.\r\n\r\n17\r\nSort ‘Country’ based on descending sum of ‘Trade Value’.\r\n\r\n18\r\nClick on the X-axis and add a reference line using the value of ‘SUM(Trade Value)’ at ‘Per Cell’ level. Remove the line.\r\n\r\n19\r\nFormat the trade values shown using ‘Currency (Custom)’ with ‘Billions (B)’ as display unit at 1 decimal place. And format the percentage from total value to 1 decimal place.\r\n\r\n20\r\nUpdate the title to include a main active title and functional subtitle, colouring ‘Exports’ and ‘Imports’ aligning with the legend. Hide ‘Country / Month’. Add ‘(Billions)’ to ‘Trade Value’ label on the X-axis.\r\n\r\n21\r\nFor Chart 2, create a new worksheet and name it “Monthly Trade’. Drag ‘Country’ and ‘Month’ to ‘Columns’ and ‘Trade Value’ to ‘Rows’ shelves. Sort ‘Country’ by descending sum of ‘Trade Value’ and change ‘Month’ to month with year format. Repeat Step 14 to set up the date and country filters.\r\n\r\n22\r\nSelect ‘Area’ chart under ‘Marks’ and drag ‘Trade Type’ to ‘Color’. Then select ‘Analysis’ and switch ‘Stack Marks’ to ‘Off’.\r\n\r\n23\r\nUnder ‘Analysis’, select ‘Create Calculated Field’ to create a new variable called ‘Smaller Trade Value’ to select the minimum ‘Trade Value’ irrespective of ‘Trade Type’ based on each time period.\r\n\r\n24\r\nDrag ‘Smaller Trade Value’ variable onto the ‘Trade Value’ axis to create a ‘combined axis’.\r\n\r\n25\r\nDrag ‘Measure Names’ from ‘Rows’ shelf to ‘Detail’ under ‘Marks’. Then click on the ‘Detail’ icon next to ‘Measure Names’ and change it to ‘Color’.\r\n\r\n26\r\nClick on ‘Colors’ under ‘Marks’ and edit the colours of the variables with ‘Smaller Trade Value’ to white. Change opacity to 100%.\r\n\r\n27\r\nDrag ‘Trade Value’ to the secondary axis on the chart. There will be a new section appearing under ‘Marks’. Change the chart type to ‘Line’ under the dropdown and remove ‘Measure Names’.\r\n\r\n28\r\nClick on the X-axis and add a reference line using a constant value indicating 1 Jan 2020. Remove the label and reduce the thickness of the dotted line.\r\n\r\n29\r\nRemove the secondary axis, the legend for the area chart, the X-axis label and hide field labels for columns.\r\n\r\n30\r\nEdit the X-axis to start on 1/1/2019 and end after 1/12/2020. Fix minor tick marks to start of the month and major tick marks to start of the year. Remove the axis titles.\r\n\r\n31\r\nEdit the Y-axis scale to show currency in billions with 1 decimal place. Change the Axis Title to ‘Trade Value (Billions)’. Edit X-axis value format to show both month and year.\r\n\r\n32\r\nBold the country values, Y-axis and X-axis values. Change the country values font size to 10. Add a title and subtitle to the chart.\r\n\r\n33\r\nAdd annotation to points when exports hit the minimal value after declining drastically.\r\n\r\n34\r\nCreate a ‘Dashboard’. Drag ‘Annual Trade’ sheet to the top and ‘Monthly Trade’ sheet to the bottom. Add a dashboard title to indicate the context of the visualisation. At the bottom of the charts, add a footnote to indicate notes for Chart 2 and the data source.\r\n\r\n35\r\nHide the worksheets and publish the dashboard to Tableau Public. Tweak the size of the dashboard to ensure that the visualisation can be view properly on desktop (at the very least).\r\n\r\n\r\n5. Major Observations\r\nOverall insight\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-26T22:35:39+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  },
  {
    "path": "posts/2021-05-22-my-1st-post/",
    "title": "My 1st Post",
    "description": "Week 3 in-class participation",
    "author": [
      {
        "name": "Kelly Koh",
        "url": "https://www.linkedin.com/in/kellykkw/"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nIn this article, we will show you how to plot a figure with multiple histograms by using ggplot2 and ggpubr packages.\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\n\r\nTo inset a graph. \r\nNext, you will use the code chunk below to install and launch ggpubr and tidyverse in RStudio.\r\nR code\r\npackages = c(‘ggpubr’, ‘tidyverse’)\r\nfor(p in packages){library if(!require(p, character.only = T)){ install.packages(p) } library(p, character.only = T) }\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\nR code\r\nwine <- read_csv(“data/wine_quality.csv”)\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted by using ggplot() and geom_histogram() of ggplot2 package. Then, ggarrange() of ggpubr package is used to patch these histogram into a single figure to reveal the distribution of the selected variables in the wine quality data sets.\r\nRcode\r\nfa <- ggplot(data=wine, aes(x= fixed acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) va <- ggplot(data=wine, aes(x= volatile acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ca <- ggplot(data=wine, aes(x= citric acid)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) rs <- ggplot(data=wine, aes(x= residual sugar)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ch <- ggplot(data=wine, aes(x= chlorides)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) fSO2 <- ggplot(data=wine, aes(x= free sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) tSO2 <- ggplot(data=wine, aes(x= total sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) density <- ggplot(data=wine, aes(x= density)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) pH <- ggplot(data=wine, aes(x= pH)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) sulphates <- ggplot(data=wine, aes(x= sulphates)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) alcohol <- ggplot(data=wine, aes(x= alcohol)) + geom_histogram(bins=20, color=“black”, fill=“light blue”)\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-22T12:20:50+08:00",
    "input_file": {}
  }
]
