[
  {
    "path": "posts/2021-06-12-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "In this post, we use the same trade data use case over a 10 year period. We will critique the visualisation and propose an interative alternative, whereby users can interact with, to address the flaws.",
    "author": [
      {
        "name": "Kelly Koh",
        "url": "https://www.linkedin.com/in/kellykkw/"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Critique of Visualisation\r\n1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2. Proposed Design\r\n2.1 Clarity\r\n2.2 Aesthetic\r\n\r\n3. Proposed Visualisation on Tableau\r\n4. Step-By-Step Preparation\r\n5. Major Observations\r\n\r\n1. Critique of Visualisation\r\nThe original visualisation (Figure 1) is created by Department of Statistics, Singapore (DOS) as an interactive infographic to showcase Singapore’s International Trade. The data are available under the sub-section of Merchandise Trade by Region/Market.\r\nFigure 11.1 Clarity\r\nSize of Bubbles: Misleading size and no context.\r\nA third set of figures (besides import and export value) determines the size of each bubble. However, there is no label to give it context. Readers can guess that it is the sum of export and import value after looking it a few bubbles but should not be forced to do so.\r\nThe bubbles are not sized correctly. For example from Figure 2 below, by overlaying Thailand’s bubble over Hong Kong’s, we can easily tell that the visual designer doubled the diameter when the area should be doubled instead. This gives an illusion that Hong Kong’s total trade value dwarfs Thailand and render the whole representation a highly misleading one.\r\n\r\nFigure 2: Comparison of Hong Kong and Thailand Bubble SizesGeographical Level: Varying levels used.\r\nMarkets of different geographical levels are being compared against each other. EU is an economic union of 27 members states; United States, Malaysia, Japan, Republic of Korea, Indonesia and Thailand are countries; and from Singapore’s perspective, Mainland China, Hong Kong and Taiwan are regional territories. This also contradicts how trade in service is represented in the later part of the infographic series whereby EU members are represented at a country level, e.g. Switzerland and Netherlands as seen in Figure 3 below. The same geographical level should be used as far as possible except for special cases like Hong Kong, which has been treated as separate from Mainland China in trade and economics.\r\n\r\nFigure 3: Major Trading Partners For Trade in Services, 2019Y-Axis & X-Axis: Improper labeling of both axes.\r\nBoth axes do not indicate the unit of measurement used, which should be ‘Export Value’ and ‘Import Value’ with ‘$X.XB’ as units.\r\nThere was no tick mark to provide reference for points on the scales.\r\n\r\nFootnotes: Inaccurate and redundant footnotes.\r\nThe first footnote mentions that the size of the bubble reflects the total merchandise trade value with the trading partner, which is incorrect as mentioned in 1.1.1 (Size of Bubbles).\r\nThe first footnote also indicates that if the value of the imports exceed exports, the centre point (white circle) of the bubble falls into the ‘Net Importers’ section and vice versa for exports. However, a glance at the infographic shows that we are unable to see 4 of the countries’ white circles, leaving readers guessing the trade status of EU and Republic of Korea since they are placed so close to the borders.\r\nThe second footnote (see Figure 4 below) mentions that since 2009, Mainland China has changed from a net importer to a net exporter and US has changed from a net exporter to net importer since 2006. Firstly, the visualization has no data showing the change for both markets. Secondly, the chart contradicts the call-out on US. From the chart, we see US as a net exporter, which leaves the reader puzzled when has US changed from a net importer to a net exporter and the purpose of this call-out.\r\n\r\nFigure 4: Annotation on trade with the US contradicts bubble chartTitle: No context given.\r\nNo title was included with the visualization to set the context. There is uncertainty on the period of observation for the visualization and why are these markets chosen. However, we do see the header ‘MERCHANDISE TRADE PERFORMANCE WITH MAJOR TRADING PARTNERS, 2020’ when referring to the source website.\r\n\r\n1.2 Aesthetic\r\nLegend: The legend for top net exporter and net importer is placed after the footnotes, making readers wonder the purpose of the star symbols in Figure 5 when looking at the visualization.\r\nFigure 5: Star symbols representing top net exporter and top net importerColours and Labels: Visualization designer has made use of labels on the chart to determine each market. However, different colors are also used for each market even though there is no new information provided.\r\nOpacity: The white circles within the larger bubbles are suppose to help place the markets in net exporter and importer sections. However, occlusion issue plague the whole visualization as the bubbles overlap. Many of the white circles could not be seen unless users interact with the visualization. And even so, an ambiguous case like the EU (see Figure 6 below) which lies close to the border still cannot be identified as an net importer or exporter.\r\nFigure 6: Ambiguity in EU trade status2. Proposed Design\r\nThe initial sketch of proposed design is as follow (Figure 7).\r\n The charts in the proposed design will help to answer some of the questions:\r\nWho is Singapore’s top trading partner? Did this change over the years?\r\nWho is the top net importer? Did this change over the years?\r\nWho is the top net exporter? Did this change over the years?\r\nWhich partner has its trade value grown over the years? Is this driven by export or import?\r\nWhich partner has its trade value shrunk over the years? Is this driven by export or import?\r\nHow have the export and import trade value of each partner change over the years?\r\n2.1 Clarity\r\nSize of Bubbles:\r\nFix the size of the bubbles and add a legend to indicate the unit of measurement ‘Annual Total Trade Value’\r\n\r\nGeographical Level:\r\nSelect the top 10 trade partners ranked by trade value at country and administrative zone level, which will exclude EU and include Germany.\r\n\r\nY-Axis & X-Axis:\r\nInclude labels ‘Import Value’ and ‘Export Value’ as headers for the axes and indicate the unit ‘$X.XB’ with tick marks for the bubble chart.\r\n\r\nFootnotes:\r\nWe have removed redundant footnote and chose not to annotate highlights of changes in trade performance of partners over the year to keep the design neat.\r\nWe will eliminate the uncertainty of the net importer and net exporter status with a separate chart that shows the ranks of partners by total trade value, net importer and net exporter status\r\nWe will include all historical export and import values and balance of trade figures of each partner under the tooltip function. This will aid readers who want to find out more about each market while not create clutter in the visualisation.\r\n\r\nTitle:\r\nInclude a main dashboard title to set the context\r\nAdd title with key insight and a functional title with reference to the axes and granularity of the data\r\n\r\n2.2 Aesthetic\r\nLegend:\r\nLegends and notes that carry key information are placed on the left of the dashboard so that reader can quickly pick up the key information required when reading the bubble chart\r\n\r\nColours and Labels:\r\nDifferent colours are being used for each partners for the purpose of recognizing the trail of historical values in both charts as the visualization animates\r\nEach bubble will retain the label with the name of the partner and total trade value of the year\r\nColours are chosen for each partner based on their geographical region, e.g. South East Asia markets like Thailand, Malaysia and Indonesia will adopt green hues, East Asia markets like Mainland China, Hong Kong, Japan, Taiwan, and Korea will adopt pink and purple hues. Germany and United States will adopt grey and brown respectively to distinguish themselves from the rest.\r\nImport value and net importers will be represented by orange and export value and net exporters will be represented by blue so that they can be easily distinguished by color blind readers.\r\n\r\nOpacity:\r\nBubbles will be semi-transparent with white borders for readers to see the sizes clearly.\r\n\r\n3. Proposed Visualisation on Tableau\r\nPlease view the proposed visualisation on Tableau Public here.\r\nFigure 8: Dashboard at 2011Figure 9: Dashboard at 2020 with tooltip over Indonesia4. Step-By-Step Preparation\r\n\r\nNo\r\nStep\r\nAction\r\n1\r\nUnzip the output folder downloaded from the SingStat website. Load the outputFile excel file into Tableau Prep Builder. Drag the ‘T1’ and ‘T2’ worksheet into main pane.\r\n\r\n2\r\nUse the Data Interpreter. Rename ‘T1’ and ‘T2’ to ‘Import’ and ‘Export’ respectively and initiate the cleaning node from each data node.\r\n\r\n3\r\nUnder the ‘Clean 1’ node, clean ‘Variables’ using ‘Split Values’ with ‘(‘ as the separator. Rename column as ‘Country’. Repeat for ‘Clean 2’.\r\n\r\n4\r\nUnder ‘Clean 1’ node, filter the rows under ‘Country’ to remove non-Country and total observations. Repeat for ‘Clean 2’.\r\n\r\n5\r\nAdd Pivot nodes after ‘Clean 1’ and ‘Clean 2’. Under ‘Pivot 1’, select all months under ‘Fields’ to the ‘Pivoted Fields’ panel. Repeat for ‘Pivot 2’.\r\n\r\n6\r\nUnder ‘Pivot 1’, rename ‘Pivot1 Names’ to ‘Month’ and change data type to ‘Date’. Rename ‘Pivot1 Values’ to ‘Import (Thousand Dollars)’. Remove ‘Variables’. Repeat for ‘Pivot 2’ but rename ‘Pivot1 Values’ to ‘Export (Thousand Dollars)’.\r\n\r\n7\r\nDo a full join between ‘Pivot 1’ and ‘Pivot 2’ with ‘Country’ and ‘Month’ as the join clauses.\r\n\r\n8\r\nCreate a ‘Clean’ node after ‘Join 1’ to merge duplicated country and month variables.\r\n\r\n9\r\nCreate a ‘Pivot’ node after ‘Clean 3’ and change ‘Export (Thousand Dollars)’ and ‘Import (Thousand Dollars)’ from columns to rows.\r\n\r\n10\r\nSplit ‘Pivot1 Names’ and rename the field of ‘Split 1’ to ‘Trade Type’. Multiply ‘(Thousand Dollars)’ by 1000 and rename it ‘Trade Value’. Remove the unnecessary fields ‘(Thousand Dollars)’ and ‘Pivot1 Names’.\r\n\r\n11\r\nCreate a ‘Output’ node after ‘Pivot 3’ node and save output as ‘Monthly Singapore Merchandise Trade’.\r\n\r\n12\r\nSet up a connection on Tableau Desktop to the ‘Monthly Singapore Merchandise Trade’ hyper’s extract.\r\n\r\n13\r\nFor the bubble chart, create a new worksheet and name it ‘Bubble Chart’. Click on ‘Analysis’ on the ribbon, and select ‘Create Calculated Field’ to create 2 calculated fields – ‘Export’ and ‘Import’ using the ‘IF X THEN X END’ formulas shown.\r\n\r\n14\r\nDrag ‘Export’ to Columns and ‘Import’ to Rows and drag ‘Country’ to ‘Detail’ under Marks. Tableau will automatically present a scatter plot.\r\n\r\n15\r\nDrag ‘Month’ to ‘Filters’ and select ‘Range of Dates’. Then input ‘1 Jan 2011’ as the start date and ‘1 Dec 2020’ as the end date. Next, drag ‘Country’ to ‘Filters’ and select ‘Top’ tab. We will select the top 10 partners by sum of the ‘Trade Value’.\r\n\r\n16\r\nDrag ‘Trade Value’ to ‘Size’ under Marks and ‘Country’ to ‘Color’. Select on ‘Color’ under marks to change the default colors. Under ‘Select Color Palette’, select Tableau 20. Assign the partners as planned, East Asia markets with pink and purple hues, South East Asia markets in greenish hues, and Germany in Grey and US in brown.\r\n\r\n17\r\nChange the type of charts under ‘Marks’ to ‘Circle’. Then select ‘Color’ to change the opacity of the bubbles to 65% and add a white border under ‘Effects’.\r\n\r\n18\r\nTo create a diagonal reference line in the bubble chart, create a new ‘Calculated Field’ called ‘Reference Line’ with ‘Export’ variable. Then drag the newly created ‘Reference Line’ to secondary Y-Axis position on the bubble chart as shown.\r\n\r\n19\r\nThen click on the ‘SUM(Reference Line)’ section under ‘Marks’. Change the chart type from ‘Circle’ to ‘Line’ and only keep ‘Country’ under ‘Detail’. Next, change the ‘Size’ of the line to the thinnest and change the ‘Opacity’ to 0%. To bring out a nice reference line, right click on the reference line on the chart and select ‘Show Trend Lines’.\r\n\r\n20\r\nRight click on the secondary Y-Axis to select ‘Synchronize Axis’ and uncheck ‘Show Header’. Right click on the trend line to format it to a light shade of grey and thinner profile. Discard ‘Measure Names’ under the ‘SUM(Import)’ section under ‘Marks’ to allow the colours of the markets to revert to initial selection.\r\n\r\n21\r\nDrag ‘Month’ into ‘Pages’. Right click on the chart to add the year to the chart by selecting ‘Area’ under ‘Annotate’. Insert ‘’ and increase the font size to 36 color to light grey. Format the annotation to remove the shading.\r\n\r\n22\r\nTo shade the background diagonally to create ‘Net Importer’ and ‘Net Exporter’ segments, we create a simple square image with 2 triangles using powerpoint. We then load this image into Tableau using ‘Map’ > ‘Background Images’. Select the image created and position it on the chart carefully using the coordinates. Tweak the washout to avoid overwhelming the chart with colours.\r\n\r\n23\r\nAdd area annotations to the chart to mark the ‘Net Importer’ and ‘Net Exporter’ segments. Format each with the colour determined – orange for import and blue for export and remove the shading of the text.\r\n\r\n24\r\nDrag ‘Country’ and ‘Trade Value’ to ‘Label’ under ‘Marks’. Format the labels – reduce font size to 8 and select ‘Match Mark Color’.\r\n\r\n25\r\nFormat all values on chart. Right click on the X-axis and select ‘Format’. A formatting pane will appear on the left. Under ‘Font’, change the font colour for X-Axis to blue. Under ‘Scale’, change the ‘Ticks’ to a darker grey and select ‘Currency (Custom)’ under ‘Numbers’ to format values to 1 decimal place in Billions. Repeat for Y-Axis (font colour in orange). Select ‘Label’ under ‘Marks’ to update the ‘Numbers’ format under ‘Pane’.\r\n\r\n26\r\nRight click on the X-Axis and select ‘Edit Axis’. Under ‘General’ tab, uncheck ‘Include Zero’ and change ‘Title’ to ‘Export Value’. Switch to ‘Tick Marks’ tab and fix the ‘Major Tick Marks’ to $10B interval and remove minor tick marks. Repeat for Y-Axis with ‘Import Value’.\r\n\r\n27\r\nAdd the main insight title and functional title with the unit of measurement and granularity of data as shown. Allow the labels in the chart to be viewed by selecting ‘Always Show’ under ‘Mark Label’ for labels that are hidden. Shift the labels around the chart to ensure that can always be seen as the pages change. Under the pages’ control, check the ‘Show history’ box and show ‘All’ of ‘Trails’.\r\n\r\n28\r\nNext, we prepare for charts that will provide more details of the partners under the tooltips when users explore the bubble charts. We create a new worksheet called ‘Tooltip Charts’. We want to feature 3 charts: i) annual trade value, ii) year-on-year change of annual trade value, iii) annual balance of trade. For chart iii), we create a new calculated field ‘Balance of Trade’ by taking sum of export minus sum of import as shown. Then, we add ‘Month’ to ‘Filters’ and select range like in Step 15. To set up the 3 charts, we drag ‘Month’ to ‘Columns’, ‘Trade Value’ and ‘Balance of Trade’ to ‘Rows’. Drag ‘Trade Value’ to ‘Rows’ again and select the drop down to do a quick table calculation – ‘Year Over Year Growth’.\r\n\r\n29\r\nChange the chart type under ‘Marks’ to ‘Bar’ and ‘Line’ respectively as shown. For chart i) on total trade value, drag ‘Trade Type’ to ‘Color’. Export will be in blue and import will be in orange, similar for chart ii). For chart iii), drag ‘Balance of Trade’ to ‘Color’ and select ‘Custom Diverging’ with the center at 0, the negative end will be the orange selected for import and positive end will be the blue selected for export.\r\n\r\n30\r\nAdd values to the ‘Label’ section under each chart by dragging ‘Trade Value’ to ‘Label’ for chart i), ‘Trade Value YoY %’ to chart ii) and ‘Balance of Trade’ to chart iii). Next, format the labels to show them all at font size 8, allowing labels to overlap. Currency will be expressed in 1 decimal place in Billions and percentage in 1 decimal place using the same format procedure shown in step 25.\r\n\r\n31\r\nAdd the total trade value label by adding a reference line to chart i)’s Y-Axis. Select ‘Sum’ and indicate ‘Value’ under ‘Label’. Under ‘Formatting’, select ‘None’ for ‘Line’.\r\n\r\n32\r\nAfter we are done with the tooltip charts, we will resize the chart by dragging the edges of the borders. We can continue to tweak after seeing how it fits under the bubble chart’s tooltip.\r\n\r\n33\r\nAs we want to indicate if the partner is a net exporter or net importer at the snapshot, we created new calculated fields ‘Net Exporter’ and ‘Net Importer’. Next, we also want to feature the rank of the partner by ‘Trade Value’, ‘Net Exporter’ and ‘Net Importer’, we created calculated fields to rank the partners as shown.\r\n\r\n34\r\nNext, we will set up the tooltip content. Drag ‘Net Exporter’, ‘Net Importer’, ‘Rank by Trade Value’, ‘Rank by Net Exporter’ and ‘Rank by Net Importer’ all to ‘Tooltip’ under the ‘SUM(Import)’ section under ‘Marks’. Click on the ‘Tooltip’ icon to launch the editor and input the text interspersed with inserted variables as shown. Insert the ‘Tooltip Charts’ worksheet at the end of the text. Format the text by colouring all import related to be orange and export related to be blue.\r\n\r\n35\r\nTo start on the second chart on the dashboard to display rank, we create a new worksheet ‘Rank’. We then drag ‘Country’ and ‘Month’ to ‘Filters’ (similar to step 15) and ‘Month’ to ‘Pages’ to limit the country and years. We create the chart by dragging ‘Month’ to ‘Columns’ and ‘Rank by Trade Value’, ‘Rank by Net Importer’ and ‘Rank by Net Exporter’ to ‘Rows’. To have the ranking computed at country level, we drag ‘Country’ to ‘Color’ under ‘All’ section under ‘Marks’. Then, we can compute the rank using ‘Country’ ausing the dropdown option.\r\n\r\n36\r\nTo sync the animation with the bubble chart, we switch the chart type under ‘Marks’ to ‘Circle’ and reduce the size of the circle. Next, we will check the ‘Show history’ box for the control for ‘Pages’ on the right pane. To show the trails of the ranks, we will show history for ‘All’ and show ‘Trails’ marks only.\r\n\r\n37\r\nTo add tooltips to the rank charts, we drag the relevant variables to the ‘Tooltip’ icon under ‘Marks’ and insert them corresponding to the content we want to feature as shown.\r\n\r\n38\r\nWe will also need to refine the Y-Axes so that we show the ranking from top to bottom. To do that, we will edit all 3 axes so that the scales are reversed. To prevent the 0 from showing, we will format the scales using ‘Custom’ and adding a semi-colon and a space (‘;’) behind the custom number format. For the net exporter and net importer scale, we will also colour the fonts with blue and orange respectively to sync with the bubble chart.\r\n\r\n39\r\nA final touch to the rank charts is to add a main title and a functional title as shown.\r\n\r\n40\r\nWe are finally ready to pull the 2 charts together to form a dashboard. Create a new dashboard and drag the ‘Bubble Chart’ and ‘Rank’ sheets to the panes as shown. Next, format the legend so that they are presented on the left side of the bubble chart. In order to prompt users to play the animation, we change the Pages header to ‘Play Animation’. Lastly, we add a main dashboard header and a footnote to point readers to the data source.\r\n\r\n41\r\nOnce completed, we hide the worksheets and proceed to publish the dashboard on Tableau Public.\r\n\r\n\r\n5. Major Observations\r\nRank Overview:\r\nFrom the rank chart below (Figure 10), we observe that out of Singapore’s top 10 merchandise trade partners in 2020, 6 are net exporters with Hong Kong always topping the list. The other 4 are net importers with Taiwan topping since 2018.\r\nMainland China has been Singapore’s top merchandise trade partner since it overtook Malaysia in 2013.\r\nThere are several switchers among the major partners: South Korea switched from a net importer to net exporter in 2017, Malaysia switched to net importer in 2019 and United States switched to net exporter in 2020.\r\nGreatest dip in rank: Indonesia had seen the greatest drop in rank, from 3rd in 2011 to 7th in 2020.\r\nGreatest climb in rank: Taiwan had climbed from 8th position in 2011 to 4th in 2020.\r\nWe will look at the bubble chart to understand the drivers for the changes mentioned above.\r\nFigure 10: Rank of trade partners from 2011 to 2020Indonesia - sharp decline driven by lower exports:\r\nFrom bubble chart and tooltip chart below (Figure 11), we see that Singapore’s export to Indonesia had shrunk almost every year, except in 2017 and 2018. The dip was the steepest in 2020 with -20.8% YoY. This has led to a big drop in annual trade value with Indonesia - the decline was more than $30B in annual trade over the 10 years.\r\nAs a result, the balance of trade with Indonesia in 2020 has also shrank to a third of 2011 to $10.3B.\r\nA Business Times article suggests that while Indonesia is a fast growing country with business opportunities, Singapore companies face infrastructural and regulatory hurdles in their expansion. In addition, the depreciation of Indonesia rupiah might have weakened the trade performance.\r\nFigure 11: Indonesia on bubble chart and tooltipMainland China - saturating growth with trade war and pandemic:\r\nFrom bubble chart and tooltip chart below (Figure 12), we notice that trade between Mainland China was not all smooth-sailing through the years. There were 2 major dips in exports in 2016 and 2018 respectively. Total trade value had been hovering between $135B-$137B since 2017.\r\nThe US-China trade war that started in 2018 led to a slowdown in the Chinese economy, which in turn reduced China’s import demand. Singapore’s export to Mainland China trended in line, dipping -8.8% in 2018. The respite in 2019 when exports grew 3.5% was short-lived. In 2020, as the the world battles the COVID-19 pandemic, export to Mainland China grew marginally at 0.6%.\r\nSingapore’s demand for Mainland China’s exports has grew over the years but had seen a slowdown from 2019. This might be due to the slowdown in global economic growth and lower demand in electronics.\r\nFigure 12: Mainland China on bubble chart and tooltipUnited States - growth disrupted by pandemic:\r\nFrom the bubble chart and tooltip chart below (Figure 13), we see that total trade with US spiked in 2018. In 2020, with the start of the COVID-19 pandemic, total trade with US dipped as imports from US plunged 19% YoY. We see divergence in export and import growth, resulting in US becoming a net exporter (+$5.7B) for the first time in the last 10 years.\r\nWith the start of new trade war between US and China in 2018, US tariffs on China led to a trade diversion, making players like Singapore more competitive in the US market. In line with this hypothesis, we observe the greatest year-on-year growth in both US exports and imports in 2018, suggesting that it is likely that Singapore has gained from the trade war.\r\nFigure 13: United States on bubble chart and tooltipMalaysia - weak export led to net importer status change:\r\nBased on the bubble chart and tooltip chart below (Figure 14), we see that Malaysia’s annual total trade value in 2020 has shrunk compared to 2011. This is mainly due to weakening exports since 2014.\r\nExports to Malaysia saw recovery briefly in 2017 and 2018, followed by a decline in 2019 before tumbling to a new low in 2020 when the pandemic hit.\r\nUncertainties from the US-China trade war might have led to weaker business confidence, weighing down the demand from Malaysia in 2019.\r\nLower exports coupled with steady demand for Malaysia’s exports led to Malaysia switching to a net importer in 2019 (-$0.7B).\r\nFigure 14: Malaysia on bubble chart and tooltip\r\n\r\n\r\n",
    "preview": "posts/2021-06-12-dataviz-makeover-2/images/dashboard.png",
    "last_modified": "2021-06-20T22:23:52+08:00",
    "input_file": "dataviz-makeover-2.knit.md"
  },
  {
    "path": "posts/2021-06-12-week-6-in-class-exercise/",
    "title": "TIL: Week 6 In-Class Exercise",
    "description": "Today I learnt in class: How to create a cycle plot and syncing control over worksheets, a calendar heatmap, proportional symbol maps of Singapore Pools outlets by winnings and private real estate transactipns, choropleth map and bring shape files into and change geographic roles on Tableau.",
    "author": [
      {
        "name": "Kelly Koh",
        "url": "https://www.linkedin.com/in/kellykkw/"
      }
    ],
    "date": "2021-06-12",
    "categories": [],
    "contents": "\r\n1. Time-Series Cycle Plot of Monthly Tourist Arrivals to Singapore\r\nPlease view the interactive visualisation on Tableau Public here.\r\n\r\n2. Time-Series Calendar Heatmap of Eventlog\r\nPlease view the interactive visualisation on Tableau Public here.\r\n\r\n3. Proportional Symbol Map of Singapore Pools Outlets by Winnings\r\nPlease view the interactive visualisation on Tableau Public here.\r\n\r\n4a. Proportional Symbol Map of Private Estate Transactions\r\nPlease view the interactive visualisation on Tableau Public here.\r\n\r\n4b. Choropleth Map of Private Estate Transactions\r\nPlease view the interactive visualisation on Tableau Public here.\r\n\r\n5. Choropleth Map of Population and Boxplot\r\nPlease view the interactive visualisation on Tableau Public here.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-12T13:33:29+08:00",
    "input_file": "week-6-in-class-exercise.knit.md"
  },
  {
    "path": "posts/2021-06-10-individual-assignment/",
    "title": "Individual Assignment (WIP)",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Kelly Koh",
        "url": "https://www.linkedin.com/in/kellykkw/"
      }
    ],
    "date": "2021-06-10",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nBackground\r\nVast Challenge 2021 - The Kronos Incident\r\nMini Challenge 2 Background\r\n\r\nMethodology and Dashboard Design\r\nMethodology\r\nSegmenting Points of Interest\r\nUnderstand the Spend\r\nUnderstand the Paths\r\nOverall Visualization Design Concepts\r\n\r\nVisualization Design\r\nPopular Locations Based on Credit Card and Loyalty Card Data\r\n\r\n\r\n\r\nInsights and Conlusions\r\nQuestion 1\r\nQuestion 2\r\nQuestion 3\r\nQuestion 4\r\nQuestion 5\r\n\r\n\r\nBackground\r\nVast Challenge 2021 - The Kronos Incident\r\nIn the roughly twenty years that Tethys-based GAStech has been operating a natural gas production site in the island country of Kronos, it has produced remarkable profits and developed strong relationships with the government of Kronos. However, GAStech has not been as successful in demonstrating environmental stewardship.\r\nIn January, 2014, the leaders of GAStech are celebrating their new-found fortune as a result of the initial public offering of their very successful company. In the midst of this celebration, several employees of GAStech go missing. An organization known as the Protectors of Kronos (POK) is suspected in the disappearance, but things may not be what they seem.\r\nMini Challenge 2 Background\r\nGAStech provides many of their employees with company cars for their personal and professional use, but unbeknownst to the employees, the cars are equipped with GPS tracking devices. We are given tracking data for the two weeks leading up to the disappearance, as well as credit card transactions and loyalty card usage data. From this data, we would identify anomalies and suspicious behaviors and identify which people use which credit and loyalty cards.\r\nMethodology and Dashboard Design\r\nMethodology\r\nSegmenting Points of Interest\r\nUnderstand the Spend\r\nUnderstand the Paths\r\nOverall Visualization Design Concepts\r\nVisualization Design\r\nPopular Locations Based on Credit Card and Loyalty Card Data\r\n\r\nInsights and Conlusions\r\nQuestion 1\r\nUsing just the credit and loyalty card data, identify the most popular locations, and when they are popular. What anomalies do you see? What corrections would you recommend to correct these anomalies? Please limit your answer to 8 images and 300 words.\r\n\r\nNo\r\nCommentary\r\nVisual\r\n1\r\ntext\r\n\r\n2\r\ntext\r\n\r\n3\r\ntext\r\n\r\n4\r\ntext\r\n\r\n5\r\ntext\r\n\r\n6\r\ntext\r\n\r\n7\r\ntext\r\n\r\n8\r\ntext\r\n\r\n\r\nQuestion 2\r\nAdd the vehicle data to your analysis of the credit and loyalty card data. How does your assessment of the anomalies in question 1 change based on this new data? What discrepancies between vehicle, credit, and loyalty card data do you find? Please limit your answer to 8 images and 500 words.\r\n\r\nNo\r\nCommentary\r\nVisual\r\n1\r\ntext\r\n\r\n2\r\ntext\r\n\r\n3\r\ntext\r\n\r\n4\r\ntext\r\n\r\n5\r\ntext\r\n\r\n6\r\ntext\r\n\r\n7\r\ntext\r\n\r\n8\r\ntext\r\n\r\n\r\nQuestion 3\r\nCan you infer the owners of each credit card and loyalty card? What is your evidence? Where are there uncertainties in your method? Where are there uncertainties in the data? Please limit your answer to 8 images and 500 words.\r\n\r\nNo\r\nCommentary\r\nVisual\r\n1\r\ntext\r\n\r\n2\r\ntext\r\n\r\n3\r\ntext\r\n\r\n4\r\ntext\r\n\r\n5\r\ntext\r\n\r\n6\r\ntext\r\n\r\n7\r\ntext\r\n\r\n8\r\ntext\r\n\r\n\r\nQuestion 4\r\nGiven the data sources provided, identify potential informal or unofficial relationships among GASTech personnel. Provide evidence for these relationships. Please limit your response to 8 images and 500 words.\r\n\r\nNo\r\nCommentary\r\nVisual\r\n1\r\ntext\r\n\r\n2\r\ntext\r\n\r\n3\r\ntext\r\n\r\n4\r\ntext\r\n\r\n5\r\ntext\r\n\r\n6\r\ntext\r\n\r\n7\r\ntext\r\n\r\n8\r\ntext\r\n\r\n\r\nQuestion 5\r\nDo you see evidence of suspicious activity? Identify 1- 10 locations where you believe the suspicious activity is occurring, and why. Please limit your response to 10 images and 500 words.\r\n\r\nNo\r\nCommentary\r\nVisual\r\n1\r\ntext\r\n\r\n2\r\ntext\r\n\r\n3\r\ntext\r\n\r\n4\r\ntext\r\n\r\n5\r\ntext\r\n\r\n6\r\ntext\r\n\r\n7\r\ntext\r\n\r\n8\r\ntext\r\n\r\n9\r\ntext\r\n\r\n10\r\ntext\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-06-10-individual-assignment/individual-assignment_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2021-06-12T10:33:04+08:00",
    "input_file": "individual-assignment.knit.md"
  },
  {
    "path": "posts/2021-06-05-week-5-in-class-exercise/",
    "title": "TIL: Week 5 In-Class Exercise",
    "description": "Today I learnt in class this week: How to build a bar chart and dot plot  to visualize uncertainty, a control chart to monitor sales and a candlestick chart for share prices in Tableau.",
    "author": [
      {
        "name": "Kelly Koh",
        "url": "https://www.linkedin.com/in/kellykkw/"
      }
    ],
    "date": "2021-06-05",
    "categories": [],
    "contents": "\r\n1. Bar Chart of Reproducible Research\r\nPlease view the interactive visualisation on Tableau Public here.\r\n\r\n2. Dot Plot of Reproducible Research\r\nPlease view the interactive visualisation on Tableau Public here.\r\n\r\n3. Control Chart of Weekly Sales\r\nPlease view the interactive visualisation on Tableau Public here.\r\n\r\n4. Candlestick Chart of Share Price of Singapore Local Banks\r\nPlease view the interactive visualisation on Tableau Public here.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-05T12:39:42+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-15-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "In this post, we present a trade data use case applying the fundamentals of Visual Analytics using Tableau. We will critique the visualisation and propose an alternative to address the flaws.",
    "author": [
      {
        "name": "Kelly Koh",
        "url": "https://www.linkedin.com/in/kellykkw/"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Critique of Visualisation\r\n1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2. Proposed Design\r\n2.1 Clarity\r\n2.2 Aesthetic\r\n\r\n3. Proposed Visualisation on Tableau\r\n4. Step-By-Step Preparation\r\n5. Major Observations\r\n\r\n1. Critique of Visualisation\r\nThe original visualisation is created by using data provided by Department of Statistics, Singapore (DOS). The data are available under the sub-section of Merchandise Trade by Region/Market.\r\n\r\n1.1 Clarity\r\nTitles: The title and legend of the data visualization do not convey the message well.\r\nTitle mentions that the charts show merchandise trade of top six trading countries without clarifying that they are trading partners of Singapore. We are also unsure if the top six are selected based on total merchandise trade.\r\nOne of the charts feature Hong Kong, which is a special administration region of China, not a country.\r\nThe unit of measure is also not clear as neither the main title nor the legend title mention if the charts are measuring physical arrivals of merchandise or the monetary value of the merchandise. The source data reveals that the unit of measure is in Singapore dollars.\r\nTitle indicates that the data is from 2019 to 2020 but the charts show values from 2019 to 2021.\r\nTitle does not mention what is the granularity of the data presented (e.g. yearly, quarterly or monthly).\r\nNo insights highlighted\r\n\r\nChart Type: The area charts are standalone, making it hard for readers to compare the trade value across the partners.\r\nY-Axis: The Y-axes of the charts are misleading.\r\nThe scales of the dual axes of each chart are not synchronised. For example, maximum scale value of export to Hong Kong with tick mark is 6M and 800K for import. The horizontal tick lines follow the primary Y-axis (export). As such, we cannot visually tell what is the relative value of export and import.\r\nFurthermore, the scales of the Y-axes are not fixed across the six charts, preventing us from determining the relative ranking of the six countries/regions based on their merchandise trade.\r\n\r\nX-Axis: The X-axis of the charts are misleading.\r\nThe x-axis of the charts is labeled ‘Month of Period’ but only show the years without minor tick marks to indicate the months. We are unsure when does the data truly end.\r\n\r\nAnnotation / Source:\r\nThere is no annotation on the graph that highlights the significant finding or conclusion.\r\nThere is no recognition of the data source.\r\n\r\n1.2 Aesthetic\r\nLegend: The legend is placed on the right side of the chart. Readers could not immediately identify if the blue or orange area refer to export or import.\r\nTitle: The main graphic title’s font size is smaller than the subtitle for each chart and not centralized.\r\nChart Order and Sizing: There is no obvious logic in the ordering of the six charts. The chart widths vary.\r\nAxis Labels: The axis labels for Y-axis and X-axis are repeated unnecessarily.\r\nColours and Shading: The area charts used blue and orange, which are friendly to color blind readers. And transparency is used to avoid occlusion issues. However, the overlap of blue and orange is distracting and prevent readers on focusing on the difference between export and import.\r\nData Ink: There is data ink on the axes labels but not the values of the tick marks.\r\n2. Proposed Design\r\nThe initial sketch of proposed design is as follow:\r\n\r\n2.1 Clarity\r\nTitles:\r\nTo use the term ‘trade partners’ to represent the countries and regions\r\nTo add a main visual title to give readers the context - ‘Singapore’s Merchandise Trade with Major Partners’\r\nTo have a title for each chart that showcases the main insight.\r\nTo add a functional subtitle for each chart. It should identify the granularity of the data, the unit of measure for the Y-Axis and the period covered.\r\n\r\nChart Type:\r\nOpt for trellis charts to allow easy comparison across the partners with 1 primary Y-axis\r\nAdd Chart 1, a bar chart to give readers an overview of how the 6 major trading partners are ranked based on annual total merchandise trade value and the split between export and import for each year\r\nChart 2 will be a modified version of the original visualisation in trellis format to show the monthly trends of export and import trade. It will showcase if the partner was a net exporter or importer month-on-month.\r\n\r\nY-Axis:\r\nKeep to a primary Y-axis\r\nIndicate the unit of measure ‘$X.XB’ on the scales and indicate the granularity in the label ‘(Billions)’\r\n\r\nX-Axis:\r\nFor Chart 2, indicate start of the year with ‘Month’ and ‘Year’ e.g. ‘Jan’19’ as major tick mark and every month as minor tick marks. Chart should not show 2021.\r\nFor Chart 2, add a reference line at start of 2020 to allow readers to easily compare between the monthly trends between 2019 and 2020\r\n\r\nAnnotation / Source:\r\nAdd annotations to both charts to highlight points that support the insights\r\nAdd notes and data source at foot of visualisation to explain the shaded area of Chart 2\r\n\r\n2.2 Aesthetic\r\nLegend:\r\nRemove the need for a legend by changing the font color of the word ‘Export’ to blue and ‘Import’ in the functional titles to orange to guide readers.\r\n\r\nTitle:\r\nAlign the titles to the left\r\nChoose distinctive font sizes for main visual title, chart title and chart subtitles\r\n\r\nChart Order and Sizing:\r\nRank the partners based on total trade value in the trellis charts\r\nAlign the tiles between Chart 1 and 2 so that readers can easily compare across charts if wanted\r\n\r\nData Ink:\r\nEnhance data ink for Y-axis and X-axis values and partner names\r\n\r\nAxis Labels:\r\nRemove both axis labels for ‘Country’ and ‘Month’ to avoid repetition and excess information\r\n\r\nColours and Shading:\r\nRemove the overlap between the blue and orange area\r\nOverlay the area charts with line charts to allow users to identify the trend easier\r\n\r\n3. Proposed Visualisation on Tableau\r\nPlease view the proposed visualisation on Tableau Public here.\r\n\r\n4. Step-By-Step Preparation\r\n\r\nNo\r\nStep\r\nAction\r\n1\r\nUnzip the output folder downloaded from the SingStat website. Load the outputFile excel file into Tableau Prep Builder. Drag the ‘T1’ and ‘T2’ worksheet into main pane.\r\n\r\n2\r\nUse the Data Interpreter. Rename ‘T1’ and ‘T2’ to ‘Import’ and ‘Export’ respectively and initiate the cleaning node from each data node.\r\n\r\n3\r\nUnder the ‘Clean 1’ node, clean ‘Variables’ using ‘Split Values’ with ‘(‘ as the separator. Rename column as ‘Country’. Repeat for ‘Clean 2’.\r\n\r\n4\r\nUnder ‘Clean 1’ node, filter the rows under ‘Country’ to remove non-Country and total observations. Repeat for ‘Clean 2’.\r\n\r\n5\r\nAdd Pivot nodes after ‘Clean 1’ and ‘Clean 2’. Under ‘Pivot 1’, select all months under ‘Fields’ to the ‘Pivoted Fields’ panel. Repeat for ‘Pivot 2’.\r\n\r\n6\r\nUnder ‘Pivot 1’, rename ‘Pivot1 Names’ to ‘Month’ and change data type to ‘Date’. Rename ‘Pivot1 Values’ to ‘Import (Thousand Dollars)’. Remove ‘Variables’. Repeat for ‘Pivot 2’ but rename ‘Pivot1 Values’ to ‘Export (Thousand Dollars)’.\r\n\r\n7\r\nDo a full join between ‘Pivot 1’ and ‘Pivot 2’ with ‘Country’ and ‘Month’ as the join clauses.\r\n\r\n8\r\nCreate a ‘Clean’ node after ‘Join 1’ to merge duplicated country and month variables.\r\n\r\n9\r\nCreate a ‘Pivot’ node after ‘Clean 3’ and change ‘Export (Thousand Dollars)’ and ‘Import (Thousand Dollars)’ from columns to rows.\r\n\r\n10\r\nSplit ‘Pivot1 Names’ and rename the field of ‘Split 1’ to ‘Trade Type’. Multiply ‘(Thousand Dollars)’ by 1000 and rename it ‘Trade Value’. Remove the unnecessary fields ‘(Thousand Dollars)’ and ‘Pivot1 Names’.\r\n\r\n11\r\nCreate a ‘Output’ node after ‘Pivot 3’ node and save output as ‘Monthly Singapore Merchandise Trade’.\r\n\r\n12\r\nSet up a connection on Tableau Desktop to the ‘Monthly Singapore Merchandise Trade’ hyper’s extract.\r\n\r\n13\r\nFor Chart 1, create a new worksheet and name it “Annual Trade’. Drag ‘Country’ and ‘Month’ to ‘Columns’ and ‘Trade Value’ to ‘Rows’ shelves.\r\n\r\n14\r\nDrag ‘Month’ to the ‘Filter Field’ section. Select ‘Range of Dates’ and indicate ‘1 Jan 2019’ as the start and ‘1 Dec 2020’ as the end.\r\n\r\n15\r\nDrag ‘Country’ to the ‘Filter Field’ section. Select the ‘Top’ tab and choose the top 6 by sum of ‘Trade Value’. Then exclude ‘Indonesia’ from the custom value list.\r\n\r\n16\r\nUnder ‘Marks’, select ‘Bar’ under the dropdown and drag ‘Trade Type’ to ‘Color’. Drag ‘Trade Value’ to ‘Label’ and add ‘Quick Table Calculation’ to add the ‘Percent of Total’ computed using ‘Cell’. Then drag ‘Trade Value’ to label again.\r\n\r\n17\r\nSort ‘Country’ based on descending sum of ‘Trade Value’.\r\n\r\n18\r\nClick on the X-axis and add a reference line using the value of ‘SUM(Trade Value)’ at ‘Per Cell’ level. Remove the line.\r\n\r\n19\r\nFormat the trade values shown using ‘Currency (Custom)’ with ‘Billions (B)’ as display unit at 1 decimal place. And format the percentage from total value to 1 decimal place.\r\n\r\n20\r\nUpdate the title to include a main active title and functional subtitle, colouring ‘Exports’ and ‘Imports’ aligning with the legend. Hide ‘Country / Month’. Add ‘(Billions)’ to ‘Trade Value’ label on the X-axis.\r\n\r\n21\r\nFor Chart 2, create a new worksheet and name it “Monthly Trade’. Drag ‘Country’ and ‘Month’ to ‘Columns’ and ‘Trade Value’ to ‘Rows’ shelves. Sort ‘Country’ by descending sum of ‘Trade Value’ and change ‘Month’ to month with year format. Repeat Step 14 to set up the date and country filters.\r\n\r\n22\r\nSelect ‘Area’ chart under ‘Marks’ and drag ‘Trade Type’ to ‘Color’. Then select ‘Analysis’ and switch ‘Stack Marks’ to ‘Off’.\r\n\r\n23\r\nUnder ‘Analysis’, select ‘Create Calculated Field’ to create a new variable called ‘Smaller Trade Value’ to select the minimum ‘Trade Value’ irrespective of ‘Trade Type’ based on each time period.\r\n\r\n24\r\nDrag ‘Smaller Trade Value’ variable onto the ‘Trade Value’ axis to create a ‘combined axis’.\r\n\r\n25\r\nDrag ‘Measure Names’ from ‘Rows’ shelf to ‘Detail’ under ‘Marks’. Then click on the ‘Detail’ icon next to ‘Measure Names’ and change it to ‘Color’.\r\n\r\n26\r\nClick on ‘Colors’ under ‘Marks’ and edit the colours of the variables with ‘Smaller Trade Value’ to white. Change opacity to 100%.\r\n\r\n27\r\nDrag ‘Trade Value’ to the secondary axis on the chart. There will be a new section appearing under ‘Marks’. Change the chart type to ‘Line’ under the dropdown and remove ‘Measure Names’.\r\n\r\n28\r\nClick on the X-axis and add a reference line using a constant value indicating 1 Jan 2020. Remove the label and reduce the thickness of the dotted line.\r\n\r\n29\r\nRemove the secondary axis, the legend for the area chart, the X-axis label and hide field labels for columns.\r\n\r\n30\r\nEdit the X-axis to start on 1/1/2019 and end after 1/12/2020. Fix minor tick marks to start of the month and major tick marks to start of the year. Remove the axis titles.\r\n\r\n31\r\nEdit the Y-axis scale to show currency in billions with 1 decimal place. Change the Axis Title to ‘Trade Value (Billions)’. Edit X-axis value format to show both month and year.\r\n\r\n32\r\nBold the country values, Y-axis and X-axis values. Change the country values font size to 10. Add a title and subtitle to the chart.\r\n\r\n33\r\nAdd annotation to points whereby there are interesting trends.\r\n\r\n34\r\nCreate a ‘Dashboard’. Drag ‘Annual Trade’ sheet to the top and ‘Monthly Trade’ sheet to the bottom. Add a dashboard title to indicate the context of the visualisation. At the bottom of the charts, add a footnote to indicate notes for Chart 2 and the data source.\r\n\r\n35\r\nHide the worksheets and publish the dashboard to Tableau Public. Tweak the size of the dashboard to ensure that the visualisation can be view properly.\r\n\r\n\r\n5. Major Observations\r\nAnnual Trade: Annual merchandise trade value between Singapore and major partners fell in 2020, except for Taiwan and Hong Kong which grew 13% and 6% year-on-year. The dip year-on-year is the greatest for Malaysia, registering a $9.5B decline driven mainly by lower exports. The next biggest dip came from United States, which registered $2.6B year-on-year decline, which instead is driven by lower imports.\r\nMainland China: The monthly trends showed that the trade decline with Mainland China in 2020 was due to a sharp dip in Feb’20 for both export and import trade. This coincided with the COVID-19 lock down in Mainland China which started in end Jan’20. Trade between Singapore and Mainland China bounced back in Mar’20. Export to China continued to grow and reached a new high at $8.0B in Aug’20 before hovering at $7.0B per month thereafter.\r\nMalaysia: Trade to Malaysia for both export and import saw a sharp dip in Apr’20. This coincided with the start of Singapore’s Circuit Breaker period. Import started to recover in May’20 and hovered around $5.0B/month in later half of 2020. Export only recovered in Jun’20, when Singapore entered Phase 1. However, export to Malayisa hovered around $4.0B/month in later half of 2020, failing to recover to 2019 levels. Based on Enterprise Singapore’s media release, lower exports to Malaysia was partially due to lower oil domestic exports.\r\nUnited Stated: Export to United States started to outgrow import in Apr’20 and persisted through most of 2020. This is due to both higher export and lower import. Export to United States remained volatile, seeing large swings across 2020. According to Enterprise Singapore, NODX export to US in Apr’20 was led by non-monetary gold, food preparations and disk media products.\r\nTaiwan and Hong Kong: Taiwan continued to be a net import trade partner and Hong Kong a net export trade partner.\r\nJapan: Export to Japan exceeded import briefly starting in Apr’20, mainly due to lower imports. Japan returned to being a net import partner in Sep’20.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T20:39:34+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-29-week-4-in-class-exercise/",
    "title": "TIL: Week 4 In-Class Exercise",
    "description": "Today I learnt in class this week: How to build an interactive Age-Sex Pyramid and Sales & Profit Quadratic Plot in Tableau.",
    "author": [
      {
        "name": "Kelly Koh",
        "url": "https://www.linkedin.com/in/kellykkw/"
      }
    ],
    "date": "2021-05-29",
    "categories": [],
    "contents": "\r\n1. Age-Sex Pyramid of Singapore\r\nPlease view the interactive visualisation on Tableau Public here.\r\n\r\n2. Quadratic Plot of Sales and Profit By States\r\nPlease view the interactive visualisation on Tableau Public here.\r\n\r\n3. Coordinate View of English and Math Scores\r\nPlease view the interactive visualisation on Tableau Public here.\r\n).\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-29T13:36:22+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-22-my-1st-post/",
    "title": "My 1st Post",
    "description": "Week 3 in-class participation",
    "author": [
      {
        "name": "Kelly Koh",
        "url": "https://www.linkedin.com/in/kellykkw/"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nIn this article, we will show you how to plot a figure with multiple histograms by using ggplot2 and ggpubr packages.\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\n\r\nTo inset a graph. \r\nNext, you will use the code chunk below to install and launch ggpubr and tidyverse in RStudio.\r\nR code\r\npackages = c(‘ggpubr’, ‘tidyverse’)\r\nfor(p in packages){library if(!require(p, character.only = T)){ install.packages(p) } library(p, character.only = T) }\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\nR code\r\nwine <- read_csv(“data/wine_quality.csv”)\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted by using ggplot() and geom_histogram() of ggplot2 package. Then, ggarrange() of ggpubr package is used to patch these histogram into a single figure to reveal the distribution of the selected variables in the wine quality data sets.\r\nRcode\r\nfa <- ggplot(data=wine, aes(x= fixed acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) va <- ggplot(data=wine, aes(x= volatile acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ca <- ggplot(data=wine, aes(x= citric acid)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) rs <- ggplot(data=wine, aes(x= residual sugar)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ch <- ggplot(data=wine, aes(x= chlorides)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) fSO2 <- ggplot(data=wine, aes(x= free sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) tSO2 <- ggplot(data=wine, aes(x= total sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) density <- ggplot(data=wine, aes(x= density)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) pH <- ggplot(data=wine, aes(x= pH)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) sulphates <- ggplot(data=wine, aes(x= sulphates)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) alcohol <- ggplot(data=wine, aes(x= alcohol)) + geom_histogram(bins=20, color=“black”, fill=“light blue”)\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-22T12:20:50+08:00",
    "input_file": {}
  }
]
