[
  {
    "path": "posts/2021-05-15-dataviz-makeover-1/",
    "title": "DataViz Makeover 1 (Work in Progress)",
    "description": "In this post, we present a trade data use case applying the fundamentals of Visual Analytics using Tableau. We will critique the visualisation and propose an alternative to address the flaws.",
    "author": [
      {
        "name": "Kelly Koh",
        "url": "https://www.linkedin.com/in/kellykkw/"
      }
    ],
    "date": "2021-05-26",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1 Critique of Visualisation\r\n1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2 Proposed Design\r\n2.1 Clarity\r\n2.2 Aesthetic\r\n\r\n3 Proposed Visualisation on Tableau\r\n4 Step-By-Step Preparation\r\n5 Major Observations\r\n\r\n1 Critique of Visualisation\r\nThe original visualisation is created by using data provided by Department of Statistics, Singapore (DOS). The data are available under the sub-section of Merchandise Trade by Region/Market.\r\n\r\n1.1 Clarity\r\nTitles: The title and legend of the data visualization do not convey the message well.\r\nThe title mentions that the charts show merchandise trade of top six trading countries without clarifying that they are trading partners of Singapore. We are also unsure if the top six are selected based on total merchandise trade.\r\nOne of the charts feature Hong Kong, which is a special administration region of China, not a country.\r\nThe unit of measure is also not clear as neither the main title nor the legend title mention if the charts are measuring physical arrivals of merchandise or the monetary value of the merchandise. The source data reveals that the unit of measure is in Singapore dollars.\r\nThe title indicates that the data is from 2019 to 2020 but the charts show values from 2019 to 2021.\r\nThe title does not mention what is the granularity of the data presented (e.g. yearly, quarterly or monthly).\r\nY-Axis: The Y-axes of the charts are misleading.\r\nThe scales of the dual axes of each chart are not synchronized. For example, maximum scale value of export to Hong Kong with tick mark is 6M and 800K for import. The horizontal tick lines follow the primary Y-axis (export). As such, we cannot visually tell what is the relative value of export and import.\r\nFurthermore, the scales of the Y-axes are not fixed across the six charts, preventing us from determining the relative ranking of the six countries/regions based on their merchandise trade.\r\nX-Axis: The X-axis of the charts are misleading.\r\nThe x-axis of the charts is labeled ‘Month of Period’ but only show the years without minor tick marks to indicate the months. We are unsure when does the data truly end.\r\nType of Graph: Area charts are usually used to depict quantitative volume change over time. They focus on analyzing the part-to-whole relation. The use of the area chart without equal dual axes could mislead readers into comparing the relative amount of export and import of each country/region.\r\nSubtitle / Annotation: There is no subtitle or annotation on the graph that highlights the significant finding or conclusion.\r\n1.2 Aesthetic\r\nLegend: The legend is placed on the right side of the chart. Readers could not immediately identify if the blue or yellow area refer to export or import.\r\nTitle: The main graphic title’s font size is smaller than the subtitle for each chart and not centralized.\r\nChart Order and Sizing: There is no obvious logic in the ordering of the six charts. The chart widths vary.\r\nData Ink: There is data ink on the axes labels but not the values of the tick marks.\r\nAxis Labels: The axis labels for Y-axis and X-axis are repeated unnecessarily.\r\nColours and Shading: The area charts used blue and yellow, which are friendly to color blind readers. And transparency is used to avoid occlusion issues. However, the overlap of blue and yellow is distracting and prevent readers on focusing on the difference between export and import.\r\n2 Proposed Design\r\nThe initial sketch of proposed design is as follow:\r\n\r\n2.1 Clarity\r\nTitles:\r\nY-Axis:\r\nX-Axis:\r\nType of Chart:\r\nSubtitle / Annotation:\r\n2.2 Aesthetic\r\nLegend:\r\nTitle:\r\nChart Order and Sizing:\r\nData Ink:\r\nAxis Labels:\r\nColours and Shading:\r\n3 Proposed Visualisation on Tableau\r\nPlease view the proposed visualisation on Tableau Public here.\r\n4 Step-By-Step Preparation\r\n\r\nNo\r\nStep\r\nAction\r\n1\r\nSelect only the top table for each data set and paste into a new sheet using Microsoft Excel.\r\n\r\n2\r\nImport the data into Tableau.\r\n\r\n3\r\nUse Tableau to pivot the data in sheet, with measure values in columns and age in rows.\r\n\r\n4\r\nRemove the CNT in Measure Values.\r\n\r\n5\r\nView the data in Tableau.\r\n\r\n6\r\nExport the data and save the file with an appropriate name.\r\n\r\n7\r\nRepeat steps 1 – 6 for both Male and Female sections. Merge the exported files using Microsoft Excel and add a Category column to identify the dataset source.\r\n\r\n8\r\nImport the cleaned dataset into Tableau.\r\n\r\n9\r\nChange the LFPR from value to percentage by adding a calculated field.\r\n\r\n10\r\nChange the data types to the correct ones and rename columns for better clarity.\r\n\r\n\r\n5 Major Observations\r\nOverall insight\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-26T14:27:25+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-22-my-1st-post/",
    "title": "My 1st Post",
    "description": "Week 3 in-class participation",
    "author": [
      {
        "name": "Kelly Koh",
        "url": "https://www.linkedin.com/in/kellykkw/"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nIn this article, we will show you how to plot a figure with multiple histograms by using ggplot2 and ggpubr packages.\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\n\r\nTo inset a graph. \r\nNext, you will use the code chunk below to install and launch ggpubr and tidyverse in RStudio.\r\nR code\r\npackages = c(‘ggpubr’, ‘tidyverse’)\r\nfor(p in packages){library if(!require(p, character.only = T)){ install.packages(p) } library(p, character.only = T) }\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\nR code\r\nwine <- read_csv(“data/wine_quality.csv”)\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted by using ggplot() and geom_histogram() of ggplot2 package. Then, ggarrange() of ggpubr package is used to patch these histogram into a single figure to reveal the distribution of the selected variables in the wine quality data sets.\r\nRcode\r\nfa <- ggplot(data=wine, aes(x= fixed acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) va <- ggplot(data=wine, aes(x= volatile acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ca <- ggplot(data=wine, aes(x= citric acid)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) rs <- ggplot(data=wine, aes(x= residual sugar)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ch <- ggplot(data=wine, aes(x= chlorides)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) fSO2 <- ggplot(data=wine, aes(x= free sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) tSO2 <- ggplot(data=wine, aes(x= total sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) density <- ggplot(data=wine, aes(x= density)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) pH <- ggplot(data=wine, aes(x= pH)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) sulphates <- ggplot(data=wine, aes(x= sulphates)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) alcohol <- ggplot(data=wine, aes(x= alcohol)) + geom_histogram(bins=20, color=“black”, fill=“light blue”)\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-22T12:20:50+08:00",
    "input_file": {}
  }
]
